<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
    public function run()
    {
        $permissions = [
            'مستخدم',
            'تاجر',




            'المديرين',
            'عرض المديرين',
            'اضافه مدير',
			'حذف مدير',
			'تعديل مدير',

			'رئيسيه المدير',
			'رئيسيه التجار',

            'عرض النقاط',
            'اضافة نقاط',
            'تعديل نقاط',
            'حذف نقاط',
            'اعدادات النقاط',


            'عرض التجار',
            'اضافة تاجر',
            'تعديل تاجر',
            'حذف تاجر',

            'عرض المستخدمين',
            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'عرض المنتجات',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',

            'المراجعات',
			'منتجات مقبوله',
			'منتجات مرفوضه',
			'رفض منتجات',
			'قبول منتجات',

            'الاقسام',
            'اضافة قسم',
            'تعديل قسم',
            'حذف قسم',

			'كل الاشعارات',
            'ارسال اشعار',
            'الرسائل',
			'ارسال رساله',

            'OTP',
            'عرض رموز OTP ',

            'عرض الاعلانات',
            'اضافه اعلان',
            'ايقاف اعلان',
            'تجديد اعلان',
            'حذف اعلان',


        ];
        foreach ($permissions as $permission) {
        Permission::create(['name' => $permission]);
        }
    }
}
